УчебнаяКонфигурация/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.ТипКоличество</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ТипСумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчебнаяКонфигурация/src/Documents/Продажа/Forms/DocumentForm/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ПересчетТабличнойЧастиКлиент.ВыполнитьПересчетПолейСтрокиТабличнойЧасти(
	ЭтотОбъект, "Товары", Элементы.Товары.ТекущаяСтрока, "Цена");
EndProcedure

&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ПересчетТабличнойЧастиКлиент.ВыполнитьПересчетПолейСтрокиТабличнойЧасти(
	ЭтотОбъект, "Товары", Элементы.Товары.ТекущаяСтрока, "Количество");
EndProcedure

#КонецОбласти
